In [430]:
import pandas as pd
import numpy as np

In [431]:
# read csv
df = pd.read_csv('../OriginalData/tb.csv')
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [432]:
# prettify column names
df.columns = list(df.columns[0:3]) + [c[7:] for c in df.columns[3:]]
df.head()

,iso2,year,new_sp,m04,m514,m014,m1524,m2534,m3544,m4554,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [433]:
# fill NaN with value 0
df.fillna(0, inplace=True)
df.head()

,iso2,year,new_sp,m04,m514,m014,m1524,m2534,m3544,m4554,...,f04,f514,f014,f1524,f2534,f3544,f4554,f5564,f65,fu
0,AD,1989,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AD,1990,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AD,1991,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AD,1992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AD,1993,15.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [434]:
# drop unnecessary and undefined columns
df.drop('m04', axis='columns', inplace=True)
df.drop('f04', axis='columns', inplace=True)
df.drop('m514', axis='columns', inplace=True)
df.drop('f514', axis='columns', inplace=True)
df.drop('new_sp', axis=1, inplace=True)
df.drop('mu', axis=1, inplace=True)
df.drop('fu', axis=1, inplace=True)
df.head()

,iso2,year,m014,m1524,m2534,m3544,m4554,m5564,m65,f014,f1524,f2534,f3544,f4554,f5564,f65
0,AD,1989,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,AD,1990,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,AD,1991,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,AD,1992,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,AD,1993,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [435]:
# melt DataFrame
df = df.melt(id_vars=['iso2', 'year'], var_name='sex_age', value_name='cases')
df.head()

  iso2  year sex_age  cases
0   AD  1989    m014    0.0
1   AD  1990    m014    0.0
2   AD  1991    m014    0.0
3   AD  1992    m014    0.0
4   AD  1993    m014    0.0

In [436]:
# split column 'sex_age' into 'sex' and 'age'
df['sex'] = df['sex_age'].str[0]
df['age'] = pd.to_numeric(df['sex_age'].str[1:])
df.head()

  iso2  year sex_age  cases sex  age
0   AD  1989    m014    0.0   m   14
1   AD  1990    m014    0.0   m   14
2   AD  1991    m014    0.0   m   14
3   AD  1992    m014    0.0   m   14
4   AD  1993    m014    0.0   m   14

In [437]:
# drop redundant column 'sex_age'
df.drop('sex_age', axis=1, inplace=True)
df.head()

  iso2  year  cases sex  age
0   AD  1989    0.0   m   14
1   AD  1990    0.0   m   14
2   AD  1991    0.0   m   14
3   AD  1992    0.0   m   14
4   AD  1993    0.0   m   14

In [438]:
# temporary values transform for proper sort
age_fun = lambda x: 6500 if x == 65 else x
df['age'] = df['age'].map(age_fun)
df.sample(10)

      iso2  year   cases sex   age
43359   LR  1987     0.0   f    14
26258   MC  1997     0.0   m  4554
9834    PE  1994     0.0   m  1524
19371   GW  1993     0.0   m  3544
53831   GM  1994     0.0   f  2534
52355   BD  1997  2634.0   f  2534
44504   PG  1992     0.0   f    14
53026   CM  1985     0.0   f  2534
78654   MY  2004   532.0   f  6500
80251   TV  1992     0.0   f  6500

In [439]:
# prettify column 'age'
age_map = {14: '0-14', 1524: '15-24', 2534: '25-34', 3544: '35-44', 4554: '45-54', 5564: '55-64', 6500: '65+'}
df['age'] = df['age'].map(age_map)
df.sample(10)

      iso2  year  cases sex    age
11235   VC  2005    0.0   m  15-24
43684   ML  1986    0.0   f   0-14
36381   GA  1980    0.0   m    65+
29084   AR  2003  366.0   m  55-64
36190   EG  2007  214.0   m    65+
26615   MU  2002   12.0   m  45-54
3589    MW  1994    0.0   m   0-14
47444   CY  2006    2.0   f  15-24
33276   RU  1988    0.0   m  55-64
8448    KI  2006   18.0   m  15-24

In [440]:
# create pivot table
df = pd.pivot_table(df, index=['iso2', 'year', 'age', 'sex'], values='cases', aggfunc=np.sum)
df.drop(0, axis=0, inplace=True)
df.head(20)

                     cases
iso2 year age   sex
AD   1989 0-14  f      0.0
                m      0.0
          15-24 f      0.0
                m      0.0
          25-34 f      0.0
                m      0.0
          35-44 f      0.0
                m      0.0
          45-54 f      0.0
                m      0.0
          55-64 f      0.0
                m      0.0
          65+   f      0.0
                m      0.0
     1990 0-14  f      0.0
                m      0.0
          15-24 f      0.0
                m      0.0
          25-34 f      0.0
                m      0.0

In [441]:
df.tail(20)

                      cases
iso2 year age   sex
ZW   2007 45-54 f     553.0
                m     716.0
          55-64 f     213.0
                m     292.0
          65+   f      90.0
                m     153.0
     2008 0-14  f     145.0
                m     127.0
          15-24 f     840.0
                m     614.0
          25-34 f       0.0
                m       0.0
          35-44 f    2890.0
                m    3316.0
          45-54 f     467.0
                m     704.0
          55-64 f     174.0
                m     263.0
          65+   f     105.0
                m     185.0

In [442]:
# save DataFrame to csv file
df.to_csv("../AnalysisData/tb_analysed.csv")